from app.database.models import AdventDay
from app.database.requests import get_advent_day, add_advent_day, update_advent_day

msg_wins_1 = """Поздравляем, удача выбрала именно вас — вы выиграли подарочную карту MAAG! Теперь вы можете исполнить своё новогоднее фэшн-желание.

С вами свяжется менеджер и обсудит детали получения подарка.

*рассылка подарков будет осуществляться до конца января 2026 года"""

msg_wins_2 = """Ура, вы стали победителем — новогодняя магия явно на вашей стороне! 

Ловите стильный аксессуар и добавляйте своему образу яркости в праздничный сезон.

С вами свяжется менеджер и обсудит детали получения подарка.

*рассылка подарков будет осуществляться до конца января 2026 года"""

msg_wins_3 = """Вау! Вы стали обладателем нашего эксклюзивного подарочного набора! 

С вами свяжется менеджер и обсудит детали получения подарка.

*рассылка подарков будет осуществляться до конца января"""

advent_calendar = [
    AdventDay(day=17,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[
                  "Пусть вечер пройдёт комфортно: любимая одежда, согревающий чай, мягкий плед и ваш любимый фильм или сериал. Это все точно поднимет ваше настроение."],
              count_wins_1=2,
              count_wins_2=1,
              count_wins_3=0),
    AdventDay(day=18,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[
                  "2026 —  ваш год: без лишней суеты и с правильной расстановкой приоритетов. Шаг за шагом вы увидите, как ваши усилия начнут приносить плоды. Не ждите мгновенных результатов — вы и сами не заметите, как начнут сбываться ваши давние желания."],
              count_wins_1=2,
              count_wins_2=2,
              count_wins_3=0),
    AdventDay(day=19,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[
                  "Ловите классный рецепт зимнего напитка! Тёплый апельсиново-имбирный чай. В чашку — ломтик апельсина, щепотку имбиря, чайную ложку мёда и горячую воду. Настоять 3–4 минуты."],
              count_wins_1=1,
              count_wins_2=0,
              count_wins_3=0),
    AdventDay(day=20,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[
                  "Пусть день пройдет в вашем ритме. Да здравствуют комфорт, любимая одежда и напитки! А ещё — стильные детали, которые радуют и делают образ гармоничным."],
              count_wins_1=0,
              count_wins_2=3,
              count_wins_3=0),
    AdventDay(day=21,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[""" Комфортный и стильный образ, который легко повторить: оверсайз сверху и собранный низ. Молочные и бежевые оттенки добавят уюта. А стильные перчатки, шапка-ушанка или балаклава станут ярким акцентом.

Подобрать подходящий аксессуар можно на сайте maag-fashion.com в разделах <a href="https://maag-fashion.com/collections/women-accessories/?utm_source=telegram&utm_medium=advent-calendar&utm_campaign=maag_advent_bot">«Аксессуары»</a> и <a href="https://maag-fashion.com/collections/women-jewellery/?utm_source=telegram&utm_medium=advent-calendar&utm_campaign=maag_advent_bot">«Украшения»</a>""",
                          """В любом образе важен акцент. Выберите одну деталь — маленькую, но заметную: шарф с принтом, брошь или контрастные перчатки. Этот элемент поможет вам выстроить гармоничный и модный аутфит.

Подобрать подходящий аксессуар вы можете на сайте maag-fashion.com в разделах <a href="https://maag-fashion.com/collections/women-accessories/?utm_source=telegram&utm_medium=advent-calendar&utm_campaign=maag_advent_bot">«Аксессуары»</a> и <a href="https://maag-fashion.com/collections/women-jewellery/?utm_source=telegram&utm_medium=advent-calendar&utm_campaign=maag_advent_bot">«Украшения»</a>"""],
              count_wins_1=0,
              count_wins_2=0,
              count_wins_3=0),
    AdventDay(day=22,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[
                  "Желаем лёгкой и атмосферной подготовки к Новому году. Без суеты и спешки. Пусть вас сопровождают ощущение уюта и радостного предвкушения праздника."],
              count_wins_1=3,
              count_wins_2=1,
              count_wins_3=0),
    AdventDay(day=23,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[
                  "Рецепт зимнего десерта к новогоднему столу — запечённое яблоко с корицей. Срезать верхушку яблока, вырезать сердцевину, начинить его сахаром или мёдом, добавить корицу и поставить запекаться на 15 минут. Просто, ароматно, по-зимнему уютно."],
              count_wins_1=0,
              count_wins_2=2,
              count_wins_3=0),
    AdventDay(day=24,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[
                  """Рюкзаки вошли в повседневную моду благодаря путешественникам и студентам в середине XX века. в 1980-е многие бренды адаптировали походные модели под повседневные и учебные нужды. Сегодня это один из самых универсальных аксессуаров, который уместен и в городе, и в поездках, и в офисных образах.\n\nПодобрать рюкзак себе или в подарок можно на сайте maag-fashion.com в разделе <a href="https://maag-fashion.com/collections/men-bags-backpacks/?utm_source=telegram&utm_medium=advent-calendar&utm_campaign=maag_advent_bot">«Сумки | Рюкзаки»</a> в женском, мужском и детском отделах."""],
              count_wins_1=2,
              count_wins_2=0,
              count_wins_3=0),
    AdventDay(day=25,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[
                  "Маленькое фэшн-вдохновение. Представьте спокойную зимнюю палитру — шоколадный, сливочный, оттенок мяты, немного серебра. Стиль в духе MAAG: лаконичный, чистый, без лишнего."],
              count_wins_1=2,
              count_wins_2=3,
              count_wins_3=0),
    AdventDay(day=26,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=["""За окном — метель, на душе — предвкушение праздника, а на экране — новогоднее кино, конечно же. Думаете, фильмов с праздничным настроением, которые вы не смотрели, не существует? Держите подборку, создающую волшебную атмосферу — что-то вас обязательно удивит. Смотреть под пледом, с мандаринами вприкуску!
Эта замечательная жизнь (1947 г.)
Чудо на 34-й улице (1994 г.)
Счастливого Рождества (2005 г.) 
Семьянин (2000 г.)
Поменяться местами (1983 г.)              
8 женщин (2001 г.)"""],
              count_wins_1=0,
              count_wins_2=0,
              count_wins_3=0),
    AdventDay(day=27,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[
                  "Мода на плюшевые аксессуары пришла с трендом на тактильность в 2010-х годах. Мягкие текстуры в шарфах, сумках и других аксессуарах работают как визуальный «антистресс»."],
              count_wins_1=0,
              count_wins_2=3,
              count_wins_3=0),
    AdventDay(day=28,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[
                  "2026 год — время определённости. Лишнее уйдёт, уступив место тому, что действительно вам подходит. Появится ясность, уверенность в выборе и ощущение собственного ритма — в жизни, шопинге и желаниях."],
              count_wins_1=2,
              count_wins_2=2,
              count_wins_3=0),
    AdventDay(day=29,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[
                  "Пусть этот день станет маленьким островком спокойствия — как момент, когда находишь идеальную тёплую вещь для морозного утра. Замедлитесь, сделайте вдох, почувствуйте радость в простых модных деталях: мягкая шерсть, правильный силуэт, свет в каждом нюансе образа."],
              count_wins_1=2,
              count_wins_2=0,
              count_wins_3=0),
    AdventDay(day=30,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[
                  "Открываем сезон караоке! Включайте новогодний плейлист, с которым праздник станет ещё ближе!"],
              count_wins_1=0,
              count_wins_2=0,
              count_wins_3=0),
    AdventDay(day=31,
              msgs_wins=[msg_wins_1, msg_wins_2, msg_wins_3],
              msgs_loses=[
                  "MAAG желает вам волшебства в каждом дне! 🎄✨ Пусть 2026-й принесёт множество открытий, приятные впечатления и образы, которые идеально вас отражают. С Новым годом!"],
              count_wins_1=0,
              count_wins_2=0,
              count_wins_3=3)
]


async def migration_advent_calendar():
    for day in advent_calendar:
        db_day = await get_advent_day(day.day)
        if not db_day:
            print(f"День {day.day} добавлен")
            await add_advent_day(day)
        else:
            print(f"День {day.day} обновлен")
            await update_advent_day(day)
